
try {
  const adder = (latt, A) => {
    latt.innerHTML = latt.innerHTML + A;
  };

  const map = new Map([
        ["q", "ഴ " ] , [ "Q " ,"ഒ"  ] ,
        ["w", "ജ  " ] , [ "W " ,"ഴ"  ] ,
        ["e", "പ " ] , [ "E " ,"ഫ"  ] ,
        ["r", " ന " ] , [ "R " ,"ൻ"  ] ,
        ["t", "എ " ] , [ "T " ,"ഇ"  ] ,
        ["y", "റ " ] , [ "Y " ,"്ര"  ] ,
        ["u", "യ " ] , [ "U " ,"യ്"  ] ,
        ["i", "വ " ] , [ "I " ,"്വ"  ] ,
        ["o", "ൂ " ] , [ "O " ,"ൗ"  ] ,
        ["p", "ദ " ] , [ "P " ,"ധ"  ] ,
        ["[", ", " ] , [ "{ " ,"ൃ"  ] ,
        ["]", "ക്ക " ] , [ "} " ,"ട്ട"  ] ,
        ["a", "മ " ] , [ "| " ,"ഠ"  ] ,
        ["s", "െ " ] , [ "A " ,"േ"  ] ,
        ["d", "ക " ] , [ "S " ,"ഖ"  ] ,
        ["f", "ത " ] , [ "D " ,"ഥ"  ] ,
        ["g", "ര " ] , [ "F " ,"ർ"  ] ,
        ["h", "ല " ] , [ "G " ,"ൽ"  ] ,
        ["j", "ി " ] , [ "H " ,"ീ"  ] ,
        ["k", "ു " ] , [ "J " ,"ഉ"  ] ,
        ["l", "ാ " ] , [ "K " ,"അ"  ] ,
        [";", ".  " ] , [ "L " ,";"  ] ,
        ["'", "ന്ന " ] , [ ": " ,":"  ] ,
        ["z", "ഗ " ] , [ "" " ,"ഘ"  ] ,
        ["x", "ള " ] , [ "Z " ,"ൾ"  ] ,
        ["c", "സ " ] , [ "X " ,"ശ"  ] ,
        ["v", "ച " ] , [ "C " ,"ഛ"  ] ,
        ["b", "ങ " ] , [ "V " ,"ഞ"  ] ,
        ["n", "ണ " ] , [ "B " ,"ഞ"  ] ,
        ["m", "ട " ] , [ "N " ,"റ്റ"  ] ,
        [",", "ഷ " ] , [ "M " ,"ഹ"  ] ,
        [".", "ഭ " ] , [ "< " ,"ബ"  ] ,
        ["/", "സ " ] , [ "> " ,"ഢ"  ] ,


  ]);

  const latt = document.getElementById('cat');
  document.addEventListener('keydown', (event) => {
    const char = map.get(event.key + (event.shiftKey ? 'Shift' : ''));
    if (char) {
      adder(latt, char);
    }
  });
} catch (error) {
  console.error(error);
}

